### AWS UAT App plan Part # 2
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Plan 📖`success`
  <details><summary>Show Plan</summary>
  ```

   key = "articles/learning-to-unit-test-es.html"
        },
      + {
          + id  = (known after apply)
          + key = "assets/About-b2b111e4.js"
        },
      + {
          + id  = (known after apply)
          + key = "assets/ArticleLayouts-e0442dce.js"
        },
      + {
          + id  = (known after apply)
          + key = "assets/Articles-4f38065c.js"
        },
        {
            id  = "assets/Articles-cdca7afd.css"
            key = "assets/Articles-cdca7afd.css"
        },
      ~ {
          ~ id  = "assets/Landing-ad247451.css" -> (known after apply)
          ~ key = "assets/Landing-ad247451.css" -> "assets/Landing-61a40d7f.css"
        },
      ~ {
          ~ id  = "assets/Landing-ad66df16.js" -> (known after apply)
          ~ key = "assets/Landing-ad66df16.js" -> "assets/Landing-eaf6275a.js"
        },
      ~ {
          ~ id  = "assets/PDF-19838165.css" -> (known after apply)
          ~ key = "assets/PDF-19838165.css" -> "assets/PDF-8e379427.js"
        },
      ~ {
          ~ id  = "assets/PDF-5ddb6fa0.js" -> "assets/PDF-ed9e0e67.css"
          ~ key = "assets/PDF-5ddb6fa0.js" -> "assets/PDF-ed9e0e67.css"
        },
      ~ {
          ~ id  = "assets/Start-92288b02.js" -> (known after apply)
          ~ key = "assets/Start-92288b02.js" -> "assets/Start-b54dfad9.js"
        },
      ~ {
          ~ id  = "assets/StartButtonFloat-41022946.js" -> (known after apply)
          ~ key = "assets/StartButtonFloat-41022946.js" -> "assets/StartNav-139e3675.js"
        },
      ~ {
          ~ id  = "assets/StartButtonFloat-7308c767.css" -> "assets/StartNav-cb1e6734.css"
          ~ key = "assets/StartButtonFloat-7308c767.css" -> "assets/StartNav-cb1e6734.css"
        },
      ~ {
          ~ id  = "assets/Terminal-2e2ec67e.css" -> (known after apply)
          ~ key = "assets/Terminal-2e2ec67e.css" -> "assets/app-75e00e53.js"
        },
      - {
          - id  = "assets/Terminal-b84267ff.js"
          - key = "assets/Terminal-b84267ff.js"
        },
        {
            id  = "assets/azure_devicon_forest_green-ee780a3a.svg"
            key = "assets/azure_devicon_forest_green-ee780a3a.svg"
        },
        {
            id  = "assets/bash_devicon_forest_green-ab536553.svg"
            key = "assets/bash_devicon_forest_green-ab536553.svg"
        },
      + {
          + id  = "assets/bootstrap-37892e52.css"
          + key = "assets/bootstrap-37892e52.css"
        },
      + {
          + id  = "assets/bootstrap.esm-695d0ac0.js"
          + key = "assets/bootstrap.esm-695d0ac0.js"
        },
        {
            id  = "assets/d3_devicon_forest_green-b8696bec.svg"
            key = "assets/d3_devicon_forest_green-b8696bec.svg"
        },
        # (8 unchanged elements hidden)
        {
            id  = "assets/fontawesome-webfont-ba0c59de.woff"
            key = "assets/fontawesome-webfont-ba0c59de.woff"
        },
      + {
          + id  = "assets/github_profile_pic-3f4ad9de.js"
          + key = "assets/github_profile_pic-3f4ad9de.js"
        },
        {
            id  = "assets/github_profile_pic-66b10136.jpg"
            key = "assets/github_profile_pic-66b10136.jpg"
        },
        {
            id  = "assets/html2canvas.esm-0a33ed42.js"
            key = "assets/html2canvas.esm-0a33ed42.js"
        },
      ~ {
          ~ id  = "assets/index-9a0f5c31.css" -> "assets/index-2883df99.css"
          ~ key = "assets/index-9a0f5c31.css" -> "assets/index-2883df99.css"
        },
      ~ {
          ~ id  = "assets/index-b7d43fd6.js" -> (known after apply)
          ~ key = "assets/index-b7d43fd6.js" -> "assets/index.es-49de4352.js"
        },
      ~ {
          ~ id  = "assets/index.es-70f69c98.js" -> (known after apply)
          ~ key = "assets/index.es-70f69c98.js" -> "assets/jquery.easing-1c7b97b0.js"
        },
        {
            id  = "assets/powershell_devicon_forest_green-f06a1fda.svg"
            key = "assets/powershell_devicon_forest_green-f06a1fda.svg"
        },
        {
            id  = "assets/purify.es-3ef59d4c.js"
            key = "assets/purify.es-3ef59d4c.js"
        },
      - {
          - id  = "assets/recase-24e0a860.js"
          - key = "assets/recase-24e0a860.js"
        },
        {
            id  = "assets/tableau_logo-ec7acb2d.svg"
            key = "assets/tableau_logo-ec7acb2d.svg"
        },
        # (4 unchanged elements hidden)
        {
            id  = "index.html"
            key = "index.html"
        },
      + {
          + id  = (known after apply)
          + key = "pdf.html"
        },
      + {
          + id  = "public/github_profile_pic.png"
          + key = "public/github_profile_pic.png"
        },
        {
            id  = "public/shortpoet_open_graph.png"
            key = "public/shortpoet_open_graph.png"
        },
        {
            id  = "public/website_landing.png"
            key = "public/website_landing.png"
        },
      + {
          + id  = "pwa-192x192.png"
          + key = "pwa-192x192.png"
        },
      + {
          + id  = "pwa-512x512.png"
          + key = "pwa-512x512.png"
        },
      + {
          + id  = (known after apply)
          + key = "resume.html"
        },
      + {
          + id  = "robots.txt"
          + key = "robots.txt"
        },
      + {
          + id  = "safari-pinned-tab.svg"
          + key = "safari-pinned-tab.svg"
        },
      + {
          + id  = (known after apply)
          + key = "sitemap.xml"
        },
      + {
          + id  = "ssr-manifest.json"
          + key = "ssr-manifest.json"
        },
    ]
  ~ s3_bucket_object_version_ids = [
        "",
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "",
      + (known after apply),
      + (known after apply),
      + (known after apply),
        "",
      + (known after apply),
      + (known after apply),
        "",
      + (known after apply),
        "",
        # (16 unchanged elements hidden)
        "",
      + (known after apply),
      + (known after apply),
        "",
        # (5 unchanged elements hidden)
        "",
      + (known after apply),
      + (known after apply),
        "",
        # (3 unchanged elements hidden)
        "",
      + (known after apply),
        "",
        "",
      - "",
      - "",
      - "",
      - "",
      - "",
      + (known after apply),
      + (known after apply),
    ]
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["_headers"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "_headers"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-9a2db7dc.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/About-9a2db7dc.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-be9305fd.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/ArticleLayouts-be9305fd.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-e5c4d4ef.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Articles-e5c4d4ef.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-c8c22ab0.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Landing-c8c22ab0.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-c2eec551.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/PDF-c2eec551.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-ed9e0e67.css"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/PDF-ed9e0e67.css"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-61a40d7f.css"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Start-61a40d7f.css"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-e6442b44.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/Start-e6442b44.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-3edd60b6.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/StartNav-3edd60b6.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-cb1e6734.css"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/StartNav-cb1e6734.css"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-e2841901.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/app-e2841901.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/bootstrap-37892e52.css"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/bootstrap-37892e52.css"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/bootstrap.esm-695d0ac0.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/bootstrap.esm-695d0ac0.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/github_profile_pic-3f4ad9de.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/github_profile_pic-3f4ad9de.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-2883df99.css"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/index-2883df99.css"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-0e5d6001.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/index.es-0e5d6001.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-894e0459.js"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "assets/jquery.easing-894e0459.js"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["public/github_profile_pic.png"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "public/github_profile_pic.png"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["pwa-192x192.png"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "pwa-192x192.png"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["pwa-512x512.png"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "pwa-512x512.png"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["robots.txt"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "robots.txt"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["safari-pinned-tab.svg"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "safari-pinned-tab.svg"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["ssr-manifest.json"] has changed%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "ssr-manifest.json"%0A      + metadata               = {}%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A  - destroy%0A%0ATerraform will perform the following actions:%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["about.html"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "about.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/about.html"%0A      + source_hash            = "836bc76cee6157575599c5ad8029bb46"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["articles.html"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "articles.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/articles.html"%0A      + source_hash            = "d66507dac62e05cba6942e26886cd367"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-en.html"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "articles/learning-to-unit-test-en.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/articles/learning-to-unit-test-en.html"%0A      + source_hash            = "68fd617b5527327528ced0a1a3bec0ff"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["articles/learning-to-unit-test-es.html"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "articles/learning-to-unit-test-es.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/articles/learning-to-unit-test-es.html"%0A      + source_hash            = "85cb29d72d203da6d377bdc11944e73c"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-9a2db7dc.js"] will be destroyed%0A  # (because key ["assets/About-9a2db7dc.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "3410d745b2a5c79b2aff8910d4e05a17" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/About-9a2db7dc.js" -> null%0A      - key                    = "assets/About-9a2db7dc.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/About-9a2db7dc.js" -> null%0A      - source_hash            = "3410d745b2a5c79b2aff8910d4e05a17" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-b2b111e4.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/About-b2b111e4.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/About-b2b111e4.js"%0A      + source_hash            = "5b050c5a9c0fe3a6d744add87b32933e"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-be9305fd.js"] will be destroyed%0A  # (because key ["assets/ArticleLayouts-be9305fd.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "c0fbf102bde80086716a75890e0d4586" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/ArticleLayouts-be9305fd.js" -> null%0A      - key                    = "assets/ArticleLayouts-be9305fd.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/ArticleLayouts-be9305fd.js" -> null%0A      - source_hash            = "c0fbf102bde80086716a75890e0d4586" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-e0442dce.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/ArticleLayouts-e0442dce.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/ArticleLayouts-e0442dce.js"%0A      + source_hash            = "f79258d463f0146248630258a319c2bc"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-4f38065c.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/Articles-4f38065c.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/Articles-4f38065c.js"%0A      + source_hash            = "ed3e79b559681bde95283db2cdb5f4ff"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-e5c4d4ef.js"] will be destroyed%0A  # (because key ["assets/Articles-e5c4d4ef.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "ef0b55ead51771e81825455db622455f" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/Articles-e5c4d4ef.js" -> null%0A      - key                    = "assets/Articles-e5c4d4ef.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/Articles-e5c4d4ef.js" -> null%0A      - source_hash            = "ef0b55ead51771e81825455db622455f" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-61a40d7f.css"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "text/css"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/Landing-61a40d7f.css"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/Landing-61a40d7f.css"%0A      + source_hash            = "4b4b60871b0c8cdca6fcf9d7e9188891"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-c8c22ab0.js"] will be destroyed%0A  # (because key ["assets/Landing-c8c22ab0.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "23cc3960e613b43912a99fd68c72b7f0" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/Landing-c8c22ab0.js" -> null%0A      - key                    = "assets/Landing-c8c22ab0.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/Landing-c8c22ab0.js" -> null%0A      - source_hash            = "23cc3960e613b43912a99fd68c72b7f0" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-eaf6275a.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/Landing-eaf6275a.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/Landing-eaf6275a.js"%0A      + source_hash            = "e17e97f9b0ae2ce2333c4a421f1de774"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-8e379427.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/PDF-8e379427.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/PDF-8e379427.js"%0A      + source_hash            = "7d1efdf8e797dfe032364614f37ba7a2"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-c2eec551.js"] will be destroyed%0A  # (because key ["assets/PDF-c2eec551.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "4d50244446fd9fd4455d79dc0acc3c85" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/PDF-c2eec551.js" -> null%0A      - key                    = "assets/PDF-c2eec551.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/PDF-c2eec551.js" -> null%0A      - source_hash            = "4d50244446fd9fd4455d79dc0acc3c85" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-61a40d7f.css"] will be destroyed%0A  # (because key ["assets/Start-61a40d7f.css"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "text/css" -> null%0A      - etag                   = "4b4b60871b0c8cdca6fcf9d7e9188891" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/Start-61a40d7f.css" -> null%0A      - key                    = "assets/Start-61a40d7f.css" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/Start-61a40d7f.css" -> null%0A      - source_hash            = "4b4b60871b0c8cdca6fcf9d7e9188891" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-b54dfad9.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/Start-b54dfad9.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/Start-b54dfad9.js"%0A      + source_hash            = "6c874cdc7f0d1f41b3c05c07c0e0abe0"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-e6442b44.js"] will be destroyed%0A  # (because key ["assets/Start-e6442b44.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "88487daab9d84234c580b59bc34cd616" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/Start-e6442b44.js" -> null%0A      - key                    = "assets/Start-e6442b44.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/Start-e6442b44.js" -> null%0A      - source_hash            = "88487daab9d84234c580b59bc34cd616" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-139e3675.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/StartNav-139e3675.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/StartNav-139e3675.js"%0A      + source_hash            = "5e97c7e0708883d62d42891789274ae3"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartNav-3edd60b6.js"] will be destroyed%0A  # (because key ["assets/StartNav-3edd60b6.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "e2437a127f4a323638f2879f50bc80e2" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/StartNav-3edd60b6.js" -> null%0A      - key                    = "assets/StartNav-3edd60b6.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/StartNav-3edd60b6.js" -> null%0A      - source_hash            = "e2437a127f4a323638f2879f50bc80e2" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-75e00e53.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/app-75e00e53.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/app-75e00e53.js"%0A      + source_hash            = "b94fc7c2524ff0b5f0b2ef40a6278a91"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/app-e2841901.js"] will be destroyed%0A  # (because key ["assets/app-e2841901.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "0bbcf79c67dfceec92ccf526f92cac18" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/app-e2841901.js" -> null%0A      - key                    = "assets/app-e2841901.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/app-e2841901.js" -> null%0A      - source_hash            = "0bbcf79c67dfceec92ccf526f92cac18" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-0e5d6001.js"] will be destroyed%0A  # (because key ["assets/index.es-0e5d6001.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "4641a91051f874c79d6225a8a1db0e81" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/index.es-0e5d6001.js" -> null%0A      - key                    = "assets/index.es-0e5d6001.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/index.es-0e5d6001.js" -> null%0A      - source_hash            = "4641a91051f874c79d6225a8a1db0e81" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-49de4352.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/index.es-49de4352.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/index.es-49de4352.js"%0A      + source_hash            = "cd575fc59030b6031b7a64f5239f4672"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-1c7b97b0.js"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "application/javascript"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "assets/jquery.easing-1c7b97b0.js"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/assets/jquery.easing-1c7b97b0.js"%0A      + source_hash            = "f3d9b4de10eee1a4926efb0f3b6f3318"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["assets/jquery.easing-894e0459.js"] will be destroyed%0A  # (because key ["assets/jquery.easing-894e0459.js"] is not in for_each map)%0A  - resource "aws_s3_bucket_object" "this" {%0A      - acl                    = "private" -> null%0A      - bucket                 = "uat.shortpoet.com" -> null%0A      - bucket_key_enabled     = false -> null%0A      - cache_control          = "max-age=31536000, immutable" -> null%0A      - content_type           = "application/javascript" -> null%0A      - etag                   = "c1039c71154f67b886d5d2b3dc629a0e" -> null%0A      - force_destroy          = true -> null%0A      - id                     = "assets/jquery.easing-894e0459.js" -> null%0A      - key                    = "assets/jquery.easing-894e0459.js" -> null%0A      - metadata               = {} -> null%0A      - server_side_encryption = "AES256" -> null%0A      - source                 = "./../../../../../app/build/assets/jquery.easing-894e0459.js" -> null%0A      - source_hash            = "c1039c71154f67b886d5d2b3dc629a0e" -> null%0A      - storage_class          = "STANDARD" -> null%0A      - tags                   = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A      - tags_all               = {%0A          - "Bucket"          = "uat.shortpoet.com"%0A          - "CloudFlare"      = "true"%0A          - "CloudFlare_Zone" = "shortpoet.com"%0A          - "Project"         = "sp"%0A          - "Terraform"       = "true"%0A        } -> null%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"] will be updated in-place%0A  ~ resource "aws_s3_bucket_object" "this" {%0A        id                     = "index.html"%0A      ~ source_hash            = "8e4eac00279831cb1885186d2ad4dc06" -> "d2405446a0edabdc854327f801d6d402"%0A        tags                   = {%0A            "Bucket"          = "uat.shortpoet.com"%0A            "CloudFlare"      = "true"%0A            "CloudFlare_Zone" = "shortpoet.com"%0A            "Project"         = "sp"%0A            "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A        # (13 unchanged attributes hidden)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["pdf.html"] will be created%0A  + resource "aws_s3_bucket_object" "this" {%0A      + acl                    = "private"%0A      + bucket                 = "uat.shortpoet.com"%0A      + bucket_key_enabled     = (known after apply)%0A      + cache_control          = "max-age=31536000, immutable"%0A      + content_type           = "text/html"%0A      + etag                   = (known after apply)%0A      + force_destroy          = true%0A      + id                     = (known after apply)%0A      + key                    = "pdf.html"%0A      + kms_key_id             = (known after apply)%0A      + server_side_encryption = (known after apply)%0A      + source                 = "./../../../../../app/build/pdf.html"%0A      + source_hash            = "201823c7ed71b79a88e733eac95dfa76"%0A      + storage_class          = "STANDARD"%0A      + tags                   = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + tags_all               = {%0A          + "Bucket"          = "uat.shortpoet.com"%0A          + "CloudFlare"      = "true"%0A          + "CloudFlare_Zone" = "shortpoet.com"%0A          + "Project"         = "sp"%0A          + "Terraform"       = "true"%0A        }%0A      + version_id             = (known after apply)%0A    }%0A%0A  # module.s3_object_uat.aws_s3_bucket_object.this["resume.html"] will be created%0A  + resource "aws_s3_bucket_object" "thi
  ```
  </details>
  *Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `App Infra`*